---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCExtrusionData.RemoveLoopAt(System.Int32)
source: html/ae35737e-fcf3-c493-5633-bf63d584cb3d.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionData.RemoveLoopAt Method

Removes the loop at the specified index.

## Syntax (C#)
```csharp
public void RemoveLoopAt(
	int index
)
```

## Parameters
- **index** (`System.Int32`) - The zero-based index of the loop to remove.